//*****************************************************
//!
//! @title testGameObject.cpp
//! @brief テスト用ゲームオブジェクト
//! @author ky
//!
//*****************************************************

#include "testGameObject.h"

using namespace game;

//-----------------------------------------------------
//! @brief コンストラクタ
//-----------------------------------------------------
TestGameObject::TestGameObject(void)
	:
mPosition()
{
}
//-----------------------------------------------------
//! @brief デストラクタ
//-----------------------------------------------------
TestGameObject::~TestGameObject(void)
{
}
//-----------------------------------------------------
//! @brief 更新
//-----------------------------------------------------
void TestGameObject::update(void)
{
	mPosition.x += 1.0f;
	if(mPosition.x > 500.0f)
	{
		mPosition.x = 0.0f;
	}
}
//-----------------------------------------------------
//! @brief 描画
//-----------------------------------------------------
void TestGameObject::draw(void)
{
	DrawLine(0, 100, static_cast<int>(mPosition.x), 100, 0xffffffff, 50);
}
